src/Documents/Покупка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Покупка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛичныеСчета</xr:Item>
				<xr:Item>AccumulationRegister.Расходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвижений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделитьПоТоварам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПокупки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/Покупка/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура РазделитьПоТоварамПриИзменении(Элемент)
	
	Если Объект.РасшифровкаПокупки.Количество() > 0 Тогда
		Ответ = Вопрос("Таблица товаров будет очищена. Ок?", РежимДиалогаВопрос.ОКОтмена,,"Ок",,);
		Если Ответ = КодВозвратаДиалога.ОК Тогда
			Объект.РасшифровкаПокупки.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	Элементы.РасшифровкаПокупки.Видимость = Объект.РазделитьПоТоварам;
	Элементы.Сумма.Видимость = НЕ Объект.РазделитьПоТоварам;
		
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.РасшифровкаПокупки.Видимость = Объект.РазделитьПоТоварам;
	Элементы.Сумма.Видимость = НЕ Объект.РазделитьПоТоварам;

КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПокупкиЦенаПриИзменении(Элемент)
	
	РассчитатьСуммуВСтроке();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПокупкиКоличествоПриИзменении(Элемент)
	
	РассчитатьСуммуВСтроке();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуВСтроке()
	
	ТекущиеДанные = Элементы.РасшифровкаПокупки.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	
	Объект.Сумма = Объект.РасшифровкаПокупки.Итог("Сумма");
	
КонецПроцедуры


&НаКлиенте
Процедура РасшифровкаПокупкиСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РасшифровкаПокупки.ТекущиеДанные;
	
	Если ТекущиеДанные.Количество = 0 Тогда
		ТекущиеДанные.Количество = 1;
	КонецЕсли;
	
	ТекущиеДанные.Цена = ТекущиеДанные.Сумма / ТекущиеДанные.Количество;
	Объект.Сумма = Объект.РасшифровкаПокупки.Итог("Сумма");
	
КонецПроцедуры
